In [15]:
import sweetviz as sv
import pandas as pd
from sqlalchemy import create_engine,text

In [2]:
engine=create_engine('postgresql://ds4a_user1:ds4a2020@ds4a-database.cnjtnqqpofwy.us-east-2.rds.amazonaws.com/ds4a_project')

In [3]:
def runQuery(sql):
    result = engine.connect().execute((text(sql)))
    return pd.DataFrame(result.fetchall(), columns=result.keys())

In [14]:
runQuery("select * from source.passenger_route_vehicle limit 10")

,secuenciarecorrido,recorridofinalizado,idvehiculo,codigoruta,fecharegistro,latitud,longitud,subendelantera,subentrasera,bajandelantera,bajantrasera,id
0,135230504,S,172,20100,2019-11-07 09:03:56,6.331005,-75.542475,1,0,0,0,2305641
1,135230504,S,172,20100,2019-11-07 09:04:00,6.330996,-75.542437,1,0,0,0,2305642
2,135230504,S,172,20100,2019-11-07 09:04:38,6.331257,-75.540075,1,0,0,0,2305643
3,135230504,S,172,20100,2019-11-07 09:05:13,6.332564,-75.538527,1,0,0,0,2305644
4,135230504,S,172,20100,2019-11-07 09:05:52,6.334029,-75.537033,0,0,0,1,2305645
5,135230504,S,172,20100,2019-11-07 09:06:32,6.334080,-75.535246,0,0,0,1,2305646
6,135230504,S,172,20100,2019-11-07 09:07:45,6.334809,-75.532321,0,0,0,1,2305647
7,135230504,S,172,20100,2019-11-07 09:07:46,6.334809,-75.532319,0,0,0,1,2305648
8,135230504,S,172,20100,2019-11-07 09:08:43,6.335184,-75.532357,1,0,0,0,2305649
9,135230504,S,172,20100,2019-11-07 09:10:10,6.333813,-75.533813,1,0,0,0,2305650

In [ ]:
#report generated with sweetviz
#queryinit = """SELECT * FROM source.passenger_route_vehicle"""
#df = runQuery(queryinit)
#report = sv.analyze(df)
#report.show_html('SWEETVIZ_REPORT.html')

<p>secuenciarecorrido: 
The variable represents the route and the vehicle on a unique route. There is no null values. It is observed that 2% (501.203) of the records contains unique id's for "recorrido". The most frequent id is 134795181.

In [7]:
queryrf =  """SELECT recorridofinalizado,count(distinct secuenciarecorrido)
            FROM source.passenger_route_vehicle
            GROUP by recorridofinalizado"""

df = runQuery(queryrf)
df

  recorridofinalizado   count
0                   N   61789
1                   S  439416

<p>recorridofinalizado: categorical variable with no missing values, 93% of the records correspond to completed routes.
Observing unique routes we can say that 88% of those correspond to completed routes and 12% remaining to unfinished routes

<p>idvehiculo: Numerical column with no missing values.The most frequent vehicle is the id 6106. We have 2371 unique vehicles

<p>codigoruta: numerical variable with no missing values. We have 248 routes and the most frequent one is the route 2102

<p>fecharegistro: datetime variable with no missing values, format YYYY-MM-DD HH:MM:SS 24H. We have values from 2019-11-01 00:00:03 until 2020-05-10 22:21:51, but we only have records from november-2019 and from march to april-2020

In [8]:
querylat =  """SELECT count(1)
                FROM source.passenger_route_vehicle prv 
                WHERE latitud > 6.3 + (3*0.223) or latitud < 6.3 - (3*0.223)
            """

df = runQuery(querylat)
df

   count
0  21049

<p>latitud: variable type float with no missing values that correspond to locations of the stop events. However we detect 19646 records with coordinates (0,0) and also we found 21049 possible outliers

In [9]:
querylon =  """SELECT count(1)
                FROM "source".passenger_route_vehicle prv 
                WHERE longitud > -76 + (3*2.27) or longitud < -76 - (3*2.27)
            """
df = runQuery(querylon)
df

   count
0  20210

<p>longitud: variable type float with no missing values that correspond to locations of the stop events. However we detect 19646 records with coordinates (0,0) and also we found 20210 possible outliers

In [10]:
querysd =  """SELECT count(1)
            FROM "source".passenger_route_vehicle prv 
            WHERE subendelantera > 1 + (3*3.09) or subendelantera < 1 - (3*3.09)
            """
df = runQuery(querysd)
df

    count
0  160010

<p>The variables Subendelantera, Subentrasera, Bajandelantera and Bajantrasera show a normal behavior according to the characteristics of these variables, due that it is normal one passenger gets on or gets off at the same time. We also discovered that the range of values is between 0 and 99. 

In the case of Subendelantera variable there are 160010 records above 10 (above 3 standard deviation from the mean), which it needs to be analyzed with more detail before taking any action.

In [11]:
#subentrasera
queryst = """SELECT count(1)
            FROM "source".passenger_route_vehicle prv 
            WHERE subentrasera > 0.2 +(3*2.33)
            """
df = runQuery(queryst)
df

   count
0  83900

<p>In the case of subentrasera variable there are 83900 records above 3 standard deviation from the mean, which it needs to be analyzed with more detail before taking any action.

In [12]:
querybd = """SELECT count(1)
            FROM "source".passenger_route_vehicle prv 
            WHERE bajandelantera > 0.3 +(3*2.44);
            """
df = runQuery(querybd)
df

    count
0  132858

<p>In the case of bajandelantera variable there are 132858 records above 3 standard deviation from the mean, which it needs to be analyzed with more detail before taking any action.

In [13]:
querybt = """SELECT count(1)
            FROM "source".passenger_route_vehicle prv 
            WHERE bajantrasera > 0.7 +(3*2.64);
            """
df = runQuery(querybt)
df

    count
0  191317

<p>In the case of bajantrasera variable there are 191317 records above 3 standard deviation from the mean, which it needs to be analyzed with more detail before taking any action.